In [1]:
import tensorflow as tf
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [2]:
tf.__version__

'2.9.1'

## Get all data form csv

In [3]:
df = pd.read_csv('../data/salaries_by_college_major.csv')

In [4]:
df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business

### checking the datatypes to normalize it

In [5]:
df.dtypes

Undergraduate Major                   object
Starting Median Salary               float64
Mid-Career Median Salary             float64
Mid-Career 10th Percentile Salary    float64
Mid-Career 90th Percentile Salary    float64
Group                                 object
dtype: object

In [6]:
df.shape

(51, 6)

In [7]:
df.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

### checking if there are any na/nulls or invalid data

In [20]:
df.isna().tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
45,False,False,False,False,False,False
46,False,False,False,False,False,False
47,False,False,False,False,False,False
48,False,False,False,False,False,False
49,False,False,False,False,False,False

In [9]:
df = df.dropna()

In [10]:
df['Starting Median Salary'].max()

74300.0

### checking max and min indexes of the data.

In [11]:
df['Starting Median Salary'].idxmax(), df['Starting Median Salary'].idxmin()

(43, 49)

### Checking the data at max and min index

In [12]:
df.loc[43], df.loc[49]

(Undergraduate Major                  Physician Assistant
 Starting Median Salary                           74300.0
 Mid-Career Median Salary                         91700.0
 Mid-Career 10th Percentile Salary                66400.0
 Mid-Career 90th Percentile Salary               124000.0
 Group                                               STEM
 Name: 43, dtype: object,
 Undergraduate Major                  Spanish
 Starting Median Salary               34000.0
 Mid-Career Median Salary             53100.0
 Mid-Career 10th Percentile Salary    31000.0
 Mid-Career 90th Percentile Salary    96400.0
 Group                                   HASS
 Name: 49, dtype: object)

### Now that we've found the major with the highest starting salary, can you write the code to find the following:

- What college major has the highest mid-career salary? How much do graduates with this major earn? (Mid-career is  defined as having 10+ years of experience).

- Which college major has the lowest starting salary and how much do graduates earn after university?

- Which college major has the lowest mid-career salary and how much can people expect to earn with this degree?

In [13]:
# What college major has the highest mid-career salary? How much do graduates with this major earn?

df['Mid-Career Median Salary'].max(), df['Mid-Career Median Salary'].idxmax()

(107000.0, 8)

In [14]:
df.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

In [15]:
df['Undergraduate Major'][8]

'Chemical Engineering'

In [16]:
df.max()

Undergraduate Major                   Spanish
Starting Median Salary                74300.0
Mid-Career Median Salary             107000.0
Mid-Career 10th Percentile Salary     71900.0
Mid-Career 90th Percentile Salary    210000.0
Group                                    STEM
dtype: object

In [17]:
# Which college major has the lowest starting salary and how much do graduates earn after university?
df['Mid-Career Median Salary'].min(), df['Mid-Career Median Salary'].idxmin()

(52000.0, 18)

In [18]:
df['Undergraduate Major'][18]

'Education'

### Calculating the diff between 90th and 10th and adding a new column using insert

In [24]:
spread_col = df['Mid-Career 90th Percentile Salary'].subtract(df['Mid-Career 10th Percentile Salary'])

In [26]:
df.insert(1, 'Spread', spread_col)

In [27]:
df.head()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,109800.0,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,96700.0,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,113700.0,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,104200.0,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,85400.0,41600.0,76800.0,50600.0,136000.0,Business

### Calculating higest potential college degrees

In [31]:
highest_potential = df.sort_values(['Mid-Career 90th Percentile Salary'], ascending=False)

In [32]:
highest_potential.head()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
17,Economics,159400.0,50100.0,98600.0,50600.0,210000.0,Business
22,Finance,147800.0,47900.0,88300.0,47200.0,195000.0,Business
8,Chemical Engineering,122100.0,63200.0,107000.0,71900.0,194000.0,STEM
37,Math,137800.0,45400.0,92400.0,45200.0,183000.0,STEM
44,Physics,122000.0,50300.0,97300.0,56000.0,178000.0,STEM

In [40]:
highest_potential[['Undergraduate Major', 'Spread']].head()

     Undergraduate Major    Spread
17             Economics  159400.0
22               Finance  147800.0
8   Chemical Engineering  122100.0
37                  Math  137800.0
44               Physics  122000.0

In [49]:
highest_spread = highest_potential.sort_values('Spread', ascending=False).head()
highest_spread.head()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
17,Economics,159400.0,50100.0,98600.0,50600.0,210000.0,Business
22,Finance,147800.0,47900.0,88300.0,47200.0,195000.0,Business
37,Math,137800.0,45400.0,92400.0,45200.0,183000.0,STEM
36,Marketing,132900.0,40800.0,79600.0,42100.0,175000.0,Business
42,Philosophy,132500.0,39900.0,81200.0,35500.0,168000.0,HASS

In [52]:
highest_spread[['Undergraduate Major', 'Spread']]

   Undergraduate Major    Spread
17           Economics  159400.0
22             Finance  147800.0
37                Math  137800.0
36           Marketing  132900.0
42          Philosophy  132500.0

In [55]:
df.groupby('Group').mean()

,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,
Business,103958.333333,44633.333333,75083.333333,43566.666667,147525.000000
HASS,95218.181818,37186.363636,62968.181818,34145.454545,129363.636364
STEM,101600.000000,53862.500000,90812.500000,56025.000000,157625.000000

In [58]:
pd.options.display.float_format = '{:,.2f}'.format

In [60]:
## This formats the float to 2 places
df.groupby('Group').mean()

,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,
Business,"103,958.33","44,633.33","75,083.33","43,566.67","147,525.00"
HASS,"95,218.18","37,186.36","62,968.18","34,145.45","129,363.64"
STEM,"101,600.00","53,862.50","90,812.50","56,025.00","157,625.00"